// 2차원 배열로 미리 모든 기타 줄과 프렛의 음을 매핑
// 인덱스는 [stringIndex][fret]로 접근
// stringIndex 0 = 1번줄(high E), 5 = 6번줄(low E)
const GUITAR_NOTES_MAP = [
    // 1번줄 (High E): 0프렛(E4)부터 12프렛(E5)까지
    // 2번줄 (B): 0프렛(B3)부터 12프렛(B4)까지
    // 3번줄 (G): 0프렛(G3)부터 12프렛(G4)까지
    // 4번줄 (D): 0프렛(D3)부터 12프렛(D4)까지
    // 5번줄 (A): 0프렛(A2)부터 12프렛(A3)까지
    // 6번줄 (Low E): 0프렛(E2)부터 12프렛(E3)까지

    ["E4","F4","F#4","G4","G#4","A4","A#4","B4","C5","C#5","D5","D#5","E5"],
    ["B3","C4","C#4","D4","D#4","E4","F4","F#4","G4","G#4","A4","A#4","B4"],
    ["G3","G#3","A3","A#3","B3","C4","C#4","D4","D#4","E4","F4","F#4","G4"],
    ["D3","D#3","E3","F3","F#3","G3","G#3","A3","A#3","B3","C4","C#4","D4"],
    ["A2","A#2","B2","C3","C#3","D3","D#3","E3","F3","F#3","G3","G#3","A3"],
    ["E2","F2","F#2","G2","G#2","A2","A#2","B2","C3","C#3","D3","D#3","E3"],
];

export default GUITAR_NOTES_MAP